# Дано положительное действительное число. Выведите его дробную часть.

n = float(input())
n = n - int(n)
print(n)